text_intro= '''Смартократия - Интегральная Политика Группы Компаний Smart Consulting (далее - ГК). Базируется на следующих ключевых принципах:

1. Принцип результативности
Вкладываем время, энергию и ресурсы только в то, что приближает к целям ГК.
2. Принцип консента
Любая инициатива имеет право на осуществление, пока не доказан ущерб от нее.
3. Принцип практики
Все гипотезы мы проверяем на практике.
4. Принцип непрерывных улучшений
Улучшаем себя на основе регулярной обратной связи и рефлексии.
5. Принцип равноценности
Каждый на равных может участвовать в подготовке решений, которые его затрагивают.
6. Принцип «все видят все»
Вся информация в ГК общедоступна, если нет причин для конфиденциальности.
7. Принцип ответственности
Каждый сотрудник отвечает за результат ГК и может на него влиять.

Кодекс Смартократии (далее – Кодекс) определяет основные понятия, правила и процессы управления, обладающие приоритетным правом применения над иными правилами управления, принимаемыми в ГК.

Все сотрудники ГК (далее – Сотрудники) могут полагаться на полномочия, данные им этим Кодексом, а также соглашаются регламентировать свою деятельность в соответствии с прописанными в нём обязанностями и ограничениями.

Основные термины Кодекса объединены в Глоссарий.'''

info_for_role = '''Роль - базовая структурная единица. ГК представляет собой объединение Ролей для наилучшей реализации своего Предназначения.

Атрибуты Роли помогают сформировать ожидания от ее работы и включают в себя следующее:

- Предназначение;
- наименование
- состав обязательств;
- состав метрик (при наличии);
- принадлежность кругу.

Каждый сотрудник ГК занимает одну или несколько Ролей. Сотрудники без Роли обязаны предпринять все действия, чтобы найти место в ГК, либо покинуть ее.

Вместе с назначением на Роль сотрудник принимает Обязательства по ее наилучшему исполнению.

Любой сотрудник ГК имеет право выступить с инициативой создания Роли. Основанием для этого является отсутствие в ГК Роли с аналогичными предназначением и обязательствами, и если зона безответственности настолько значительна, что не может быть закрыта расширением обязательств действующих Ролей. Роль создается в том Круге, которому в наибольшей степени соответствует ее предназначение.

Корректировка состава Ролей ГК производится через Законодательные встречи соответствующего Круга. Исключением является процедура архивации Роли в отсутствие "цифровых следов" ее использования.

Сотрудник, занимающий одну или несколько Ролей, имеет право выполнять любые действия в рамках своей Зоны ответственности, которые он считает полезными для исполнения своих Обязательств и реализации своего Предназначения, без дополнительных согласований, за исключением случаев, попадающих в зону ответственности Доменов.

Роли участвуют в деятельности Круга и привлекаются для реализации Проектов ГК. Порядок замещения Роли определяется Политикой замещения ролей.

К избираемым ролям относятся Роли Фасилитатор и Секретаря. На остальные Роли сотрудники ГК назначаются Лидлинком. Процедура выборов на избираемые Роли определяется Политикой проведения голосований и выборов избираемых ролей.'''
termins_code = '''В настоящем Кодексе используются следующие термины и определения:

**Роль** – это базовая структурная единица, обладающая следующими атрибутами:

- Предназначение;
- Наименование;
- Состав обязательств;
- Состав метрик (при наличии);
- Принадлежность кругу;

Основная роль - Роль, выполнением обязательств которой сотрудник занимается наибольшую часть времени в течение длительного периода. Основная Роль сотрудника может меняться.

Круг – это объединение в группу нескольких Ролей (собрание Ролей) для реализации своего предназначения;

Член круга, участник круга** – это сотрудник, назначенный на Роль внутри Круга или на Роль Лид-линка Дочернего круга;

Дочерний круг – это Круг, входящий (вложенный) в другой Круг;

Родительский круг – вышестоящий Круг по отношению к Дочернему кругу;

Сообщество, Небюджетируемый круг – временное или постоянное собрание Ролей, предназначенное для развития каких-либо идей, общих интересов и проводимое в свободное время;

Зона ответственности роли (круга) – область деятельности Компании, за которую Роль (Круг) несёт непосредственную ответственность;

Предназначение роли (круга) – цель или миссия, для выполнения которой существует Роль (Круг) (ответ на вопрос «Зачем?»);

Обязательство роли (круга) – регулярное действие в рамках Зоны ответственности для выполнения Ролью (Кругом) своего Предназначения;

Метрика – качественный или количественный измеримый показатель, необходимый для оценки выполнения Ролью (Кругом) своего Предназначения;

Политика – Набор правил и процессов, которые применяются для достижения Предназначения (целей) Компании;

Теншен – любая значимая информация, требующая внимания (в том числе значимые события, запрос или предоставление информации, нарушение Обязательств, «серые зоны» ответственности, несоблюдение правил, политик, Кодекса – все, что помогает ролям и кругу исполнять предназначение наилучшим образом и повышать эффективность в зоне ответственности);

Проект – временная деятельность, направленная на создание уникального продукта, услуги или результата;

Задача – конечный результат, получение которого ожидается с требуемым приоритетом, в согласованные сроки и с определенным качеством;

Домен роли (круга) – область, находящаяся под исключительным контролем Роли (Круга);

Назначаемая роль – Роль, назначение на которую не требует отдельных законодательных процессов;

Избираемая роль – Роль, назначение на которую происходит путём голосования внутри Круга;

Участник встречи - любой присутствующий на встрече Круга человек;

Действительный участник встречи - участник встречи Круга, назначенный на какую-либо роль в этом Круге, или Лид-линк Дочернего круга.'''
question_kr = '''Круг - это объединение в группу нескольких Ролей (собрание Ролей) для реализации своего предназначения.

Иерархия кругов определяется иерархией их предназначений:

 0 уровень – Круг, Предназначение которого совпадает с Предназначением всей ГК, и у которого нет Родительского круга (далее – Якорный круг);

1 уровень – Круги, Родительским кругом которых является Якорный круг;

2 и последующие уровни – Круги, Родительским кругом которого является Круг предыдущего уровня.

Каждый сотрудник имеет право выступить с инициативой по созданию, ликвидации, объединению или переносу круга. Данная процедура регламентируется Политикой о создании, объединении и ликвидации круга.

Круг типа "Сообщество" является добровольным объединением участников по личным и профессиональным интересам и не регламентируется данным Кодексом. Время, затраченное на работу в рамках Сообщества, не учитывается в системе фиксации усилий ГК.

Каждый круг должен иметь следующие роли:

★Лидеркруга (далееЛид-линк) –обязательнодлявсехКругов;

★Фасилитаторкруга–обязательнодляКругов, проводящих Тактические и Законодательные встречи;

★Секретарькруга–обязательнодлявсехКругов.

## Обязательные роли Круга

### Лид-линк круга

Предназначением Лид-линка является формирование и развитие команды для выполнения Предназначения круга.

Роль Лид-линк Круга является назначаемой Лид-линком Родительского круга. При этом участники Круга могут выдвинуть кандидатуру на роль Лид-линка в соответствии с Процедура определения кандидатов на роль нового лид-линка круга.

Роль Лид-линка Якорного круга утверждают Акционеры ГК.

Полномочия Лид-линка определяются Политикой. Состав Обязательств Лид-линка утверждается на Законодательной встрече Якорного круга.

Роль Лид-линк не должна являться единственной для сотрудника.

### Фасилитатор круга

Роль Фасилитатора является избираемой и отвечает за модерирование и фасилитацию встреч, проводимых в Круге. Решения Фасилитатора, принятые в ходе встречи, обладают приоритетным правом по отношению к другим участникам встречи.

Миссия Фасилитатора Круга заключается в том, чтобы встреча была полезной, все теншены разрешены или продвинуты вперёд, а каждый участник в конце встречи был более заряжен, чем в начале.

### Секретарь круга

Роль Секретаря является избираемой и отвечает за систематизацию информации и документирование проводимых в Круге встреч.

### Домен роли/круга

Домен - область, находящаяся под исключительным контролем Роли (Круга).

В случае наличия у Роли (Круга) Доменов – только она имеет полномочия контролировать и регулировать все решения и действия в рамках закрепленной за Доменом зоной ответственности, принимать решения по запросам третьих лиц на доступ к своему Домену.

Домен закрепляется за Ролью(Кругом) по решению Законодательной встречи Якорного круга.'''
oper_system = '''### Политики круга

Политики Круга предназначены для определения и систематизации правил и процессов, используемых в Круге, и являются его законодательством.

Утверждение, корректировка или отмена Политик осуществляется путём проведения Законодательных встреч.

Политики, принятые на уровне Родительского круга, автоматически распространяются на все вложенные Круги и не требуют отдельных Законодательных встреч для их принятия в Дочерних кругах. Однако, в Дочерних кругах они могут быть уточнены и детализированы.

В случае выявления противоречия законодательства Дочерних кругов Родительскому, действует Родительское.

Положения настоящего Кодекса обладают приоритетным правом законодательства на любой Круг.

Различные Круги могут принимать кросс-функциональные Политики, распространяющие своё действие на процессы взаимодействия этих Кругов.

Правила создания Политик круга регламентируются Политикой о Политиках.

### Проекты круга

Проект - единица учета в ГК. Он имеет название, цель, описание, позволяющее определить границы проекта. У каждого проекта есть владелец (Менеджер проекта). Он определяет перечень ролей, участвующих в проекте, а также срок участия Роли в Проекте. Участие Ролей в проекте регулируется Менеджером проекта и не требует дополнительных законодательных процедур.

К внутренним относятся Проекты Круга, которые нельзя соотнести с конкретной сделкой ГК или в них отсутствует внешний по отношению к ГК заказчик. Все остальные Проекты относятся к внешним.

Внутренние Проекты Круга могут быть инициированы любым участником Круга и утверждаются Лид-линком.

Законодательством Якорного круга могут быть определены Типовые внутренние проекты. Они направлены на управление Кругами ГК, заводятся во вновь создаваемых кругах автоматически и не требуют утверждения Лид-линком.

### Исключительный случай

Каждый Сотрудник в исключительной ситуации может осознанно нарушить законодательство Круга, если посчитает это необходимым, не имея возможности проинформировать участников Круга и других заинтересованных сотрудников. Сотрудник, нарушивший действующее законодательство Круга, должен поделиться своим опытом с остальными участниками Круга и сделать опыт общедоступным. При этом инициатор нарушения несёт полную ответственность (дисциплинарную, материальную) за последствия своего нарушения перед всей ГК.

Под исключительным случаем понимается следующее:

- решение нужно принимать здесь и сейчас, без возможности проинформировать и проконсультироваться с заинтересованными сторонами или если описанное в правила или политиках ГК решение или поведение не является наилучшим в сложившихся условиях.

При этом Сотруднику необходимо руководствоваться следующими принципами:

- действие помогает наилучшим образом выполнить предназначение Круга и Роли;
- сотрудник руководствуется наилучшими намерениями для выполнения предназначения Круга и Роли.'''